



DHC Working Group                                               S. Jiang
Internet-Draft                              Huawei Technologies Co., Ltd
Intended status: Standards Track                                 G. Chen
Expires: January 21, 2015                                   China Mobile
                                                             S. Krishnan
                                                                Ericsson
                                                                R. Asati
                                                     Cisco Systems, Inc.
                                                           July 20, 2014


     Registering Self-generated IPv6 Addresses in DNS using DHCPv6
                  draft-ietf-dhc-addr-registration-06

Abstract

   In networks that are centrally managed, self-generated addresses
   cause some traceability issues due to their decentralized nature.
   One of the most important issues in this regard is the inability to
   register such addresses in DNS.  This document defines a mechanism to
   register self-generated and statically configured addresses in DNS
   through a DHCPv6 server.

Status of This Memo

   This Internet-Draft is submitted in full conformance with the
   provisions of BCP 78 and BCP 79.

   Internet-Drafts are working documents of the Internet Engineering
   Task Force (IETF).  Note that other groups may also distribute
   working documents as Internet-Drafts.  The list of current Internet-
   Drafts is at http://datatracker.ietf.org/drafts/current/.

   Internet-Drafts are draft documents valid for a maximum of six months
   and may be updated, replaced, or obsoleted by other documents at any
   time.  It is inappropriate to use Internet-Drafts as reference
   material or to cite them other than as "work in progress."

   This Internet-Draft will expire on January 21, 2015.

Copyright Notice

   Copyright (c) 2014 IETF Trust and the persons identified as the
   document authors.  All rights reserved.

   This document is subject to BCP 78 and the IETF Trust's Legal
   Provisions Relating to IETF Documents
   (http://trustee.ietf.org/license-info) in effect on the date of



Jiang, et al.           Expires January 21, 2015                [Page 1]

Internet-Draft          IPv6 Address Registration              July 2014


   publication of this document.  Please review these documents
   carefully, as they describe your rights and restrictions with respect
   to this document.  Code Components extracted from this document must
   include Simplified BSD License text as described in Section 4.e of
   the Trust Legal Provisions and are provided without warranty as
   described in the Simplified BSD License.

Table of Contents

   1.  Introduction  . . . . . . . . . . . . . . . . . . . . . . . .   2
   2.  Terminology . . . . . . . . . . . . . . . . . . . . . . . . .   3
   3.  Solution Overview . . . . . . . . . . . . . . . . . . . . . .   3
   4.  DHCPv6 ADDR-REGISTRATION-REQUEST Message  . . . . . . . . . .   4
   5.  DHCPv6 Address Registration Procedure . . . . . . . . . . . .   5
     5.1.  DHCPv6 Address Registration Request . . . . . . . . . . .   5
     5.2.  Registration Expiry and Refresh . . . . . . . . . . . . .   5
     5.3.  Acknowledging Registration and Retransmission . . . . . .   6
   6.  Security Considerations . . . . . . . . . . . . . . . . . . .   7
   7.  IANA Considerations . . . . . . . . . . . . . . . . . . . . .   7
   8.  Acknowledgements  . . . . . . . . . . . . . . . . . . . . . .   7
   9.  References  . . . . . . . . . . . . . . . . . . . . . . . . .   7
     9.1.  Normative References  . . . . . . . . . . . . . . . . . .   7
     9.2.  Informative References  . . . . . . . . . . . . . . . . .   8
   Authors' Addresses  . . . . . . . . . . . . . . . . . . . . . . .   8

1.  Introduction

   In several common network scenarios, IPv6 addresses are self-
   generated by the end-hosts by appending a self-generated interface
   identifier to a network-specified prefix.  Examples of self-generated
   addresses include those created using IPv6 Stateless Address
   Configuration [RFC4862] , temporary addresses [RFC4941] and
   Cryptographically Generated Addresses (CGA) [RFC3972] etc.  In
   several tighly controlled networks, hosts with self-generated
   addresses may face some limitations.  One such limitation is related
   to the inability of nodes with self-generated addresses to register
   their IPv6-address-to-FQDN bindings in DNS.  This is related to the
   fact that, in such networks, only certain nodes (e.g.  The DHCPv6
   server) are allowed to update these bindings in order to prevent end-
   hosts from registering arbitrary addresses for their FQDNs or
   associating their addresses with arbitrary domain names.

   For nodes that obtain their addresses through DHCPv6, a solution has
   been specified in [RFC4704].  The solution works by including a
   Client FQDN option in the SOLICIT, REQUEST, RENEW or REBIND messages
   during the process of acquiring an address through DHCPv6.  This
   document provides an analogous mechanism to register self-generated
   addresses in DNS.



Jiang, et al.           Expires January 21, 2015                [Page 2]

Internet-Draft          IPv6 Address Registration              July 2014


   A new ADDR-REGISTRATION-REQUEST DHCPv6 message type is defined to
   initiate the address registration request, and two new Status codes
   are defined to indicate registration errors on the server side.

2.  Terminology

   The key words "MUST", "MUST NOT", "REQUIRED", "SHALL", "SHALL NOT",
   "SHOULD", "SHOULD NOT", "RECOMMENDED", "MAY", and "OPTIONAL" in this
   document are to be interpreted as described in [RFC2119].

   Certificate  In this document, the term "Certificate" is all referred
      to public key certificate.

3.  Solution Overview

   After successfully assigning a self-generated IPv6 address on one of
   its interfaces, an end-host implementing this specification SHOULD
   send an ADDR-REGISTRATION-REQUEST message to a DHCPv6 address
   registration server.  After receiving the address registration
   request, the DHCPv6 server registers the IPv6 address to FQDN binding
   towards a configured DNS server.  An acknowledgement MUST be sent
   back to the end host to indicate whether or not the registration
   operation succeeded.

          +----+   +-----------+                  +---------------+
          |Host|   |Edge router|                  |Addr-Reg Server|
          +----+   +-----------+                  +---------------+
            |   SLAAC   |                                 |
            |<--------->|                                 |
            |           |                                 |
            |           |    ADDR-REGISTRATION-REQUEST    |
            |-------------------------------------------->|
            |           |                                 |Register
            |           |                                 |address
            |           |         Acknowledgment          |in DNS
            |<--------------------------------------------|

                 Figure 1: Address Registration Procedure

   It is RECOMMENDED to only set up one address registration server
   within an administration domain, although there may be multiple
   DHCPv6 servers.  While multiple address registration servers does
   potentially increase the load on DNS, because of how [RFC4703] and
   [RFC4704] work, this should NOT be an issue - the servers should work
   correctly in updating DNS (either adding or removing the entries).
   The broken part with multiple servers is the 'extension' of the
   registration.  If there are two address registration servers and both
   receive the initial registration and (correctly) update DNS, the



Jiang, et al.           Expires January 21, 2015                [Page 3]

Internet-Draft          IPv6 Address Registration              July 2014


   problem comes when the client extends this but one of the servers
   does not receive this extension.  Then, the server that missed the
   extension removes the entry prematurely (i.e., when it expired
   originally).  The coordination of multiple address registration
   servers is out of scope.

4.  DHCPv6 ADDR-REGISTRATION-REQUEST Message

   The DHCPv6 client sends an ADDR-REGISTRATION-REQUEST message to a
   server to request an address to be registered in the DNS.  The format
   of the ADDR-REGISTRATION-REQUEST message is described as follows:

      0                   1                   2                   3
      0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
     +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
     |    msg-type   |               transaction-id                  |
     +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
     |                                                               |
     .                            options                            .
     .                           (variable)                          .
     |                                                               |
     +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
      msg-type             Identifies the DHCPv6 message type;
                           Set to ADDR-REGISTRATION-REQUEST (TBA1).

      transaction-id       The transaction ID for this message exchange.

      options              Options carried in this message.

                 DHCPv6 ADDR-REGISTRATION-REQUEST message

   The ADDR-REGISTRATION-REQUEST message MUST NOT contain server-
   identifier option and MUST contain the IA_NA option and the DHCPv6
   FQDN option [RFC4704].  The ADDR-REGISTRATION-REQUEST message is
   dedicated for clients to initiate an address registration request
   toward an address registration server.  Consequently, clients MUST
   NOT put any Option Request Option(s) in the ADDR-REGISTRATION-REQUEST
   message.

   Clients MUST discard any received ADDR-REGISTRATION-REQUEST messages.

   Servers MUST discard any ADDR-REGISTRATION-REQUEST messages that meet
   any of the following conditions:

   o  the message does not include a Client Identifier option.

   o  the message includes a Server Identifier option.




Jiang, et al.           Expires January 21, 2015                [Page 4]

Internet-Draft          IPv6 Address Registration              July 2014


   o  the message does not include at least one IA_NA option.

   o  the message does not include an IAADDR option encapsulated within
      the IA_NA option(s).

   o  the message does not include FQDN option (or include multiple FQDN
      options).

   o  the message includes an Option Request Option.

   Servers MUST discard any ADDR-REGISTRATION-REQUEST messages that do
   not Servers MUST discard any ADDR-REGISTRATION-REQUEST messages that
   do include any Option Request Option(s).

5.  DHCPv6 Address Registration Procedure

   The DHCPv6 protocol is used as the address registration protocol when
   a DHCPv6 server performs the role of an address registration server.
   The DHCPv6 IA_NA option [RFC3315] and the DHCPv6 FQDN option
   [RFC4704] are adopted in order to fulfill the address registration
   interactions.

5.1.  DHCPv6 Address Registration Request

   The end-host sends a DHCPv6 ADDR-REGISTRATION-REQUEST message to the
   address registration server to the All_DHCP_Relay_Agents_and_Servers
   multicast address (ff02::1:2).

   The end-host MUST include a Client Identifier option in the ADDR-
   REGISTRATION-REQUEST message to identify itself to the server.  The
   DHCPv6 ADDR-REGISTRATION-REQUEST message MUST contain at least one
   IA_NA option and exactly one FQDN option.  The IA_NA option MUST
   contain at least one IA Address option.  The valid-lifetime field of
   the IA Address option MUST be set to the period for which the client
   would like to register the binding in DNS.

   After receiving this ADDR-REGISTRATION-REQUEST message, the address
   registration server MUST register the binding between the provided
   FQDN and address(es) in DNS.  If the DHCPv6 server does not support
   address registration function, a Reply message with includes a Status
   Code option with the value the RegistrationNotSupported (TBA2) MAY be
   sent back to the initiated client.

5.2.  Registration Expiry and Refresh

   For every successful binding registration, the address registration
   server MUST record the IPv6-address-to-FQDN bindings and associated
   valid-lifetimes in its storage.



Jiang, et al.           Expires January 21, 2015                [Page 5]

Internet-Draft          IPv6 Address Registration              July 2014


   The address registration client MUST refresh the registration before
   it expires (i.e. before the valid-lifetime of the IA address elapses)
   by sending a new ADDR-REGISTRATION-REQUEST to the address
   registration server.  If the address registration server does not
   receive such a refresh after the valid-lifetime has passed, it SHOULD
   remove the IPv6-address-to-FQDN bindings in DNS, also the local
   record.

   It is RECOMMENDED that clients initiate a refresh at about 85% of the
   valid-lifetime.  Because RAs may periodically 'reset' the valid-
   lifetime, the refresh timer MUST be independently maintained from the
   address valid-lifetime.  Clients SHOULD set a refresh timer to 85% of
   the valid-lifetime when they complete a registration operation and
   only update this timer if 85% of any updated valid-lifetime would be
   sooner than the timer.

5.3.  Acknowledging Registration and Retransmission

   After an address registration server accepts an address registration
   request, it MUST send a Reply message as the response to registration
   The server is responsilbe to register all the addresses in DNS.  The
   server generates a Reply message and includes a Status Code option
   with value Success, a Server Identifier option with the server's
   DUID, and a Client Identifier option with the client's DUID.

   If there is no reply received within some interval, the client SHOULD
   retransmits the message according to section 14 of [RFC3315], using
   the following parameters:

   o  IRT ADDR_REG_TIMEOUT

   o  MRT ADDR_REG_MAX_RT

   o  MRC ADDR_REG_MAX_RC

   o  MRD 0

   Where ADDR_REG_TIMEOUT might be 1 second, ADDR_REG_MAX_RT might be 30
   minutes and ADDR_REG_MAX_RC might be 5.

   For each IA in the ADDR-REGISTRATION-REQUEST message for which the
   server does not accept its associated in registration request, the
   server adds an IA option using the IAID from the ADDR-REGISTRATION-
   REQUEST message, and includes a Status Code option with the value
   RegistrationDenied (TBA3) in the IA option.  No other options are
   included in the IA option.





Jiang, et al.           Expires January 21, 2015                [Page 6]

Internet-Draft          IPv6 Address Registration              July 2014


   Upon receiving a RegistrationDenied error status code, the client MAY
   also resend the message following normal retransmission routines
   defined in [RFC3315] with above parameters.

6.  Security Considerations

   An attacker may attempt to register large number of addresses in
   quick succession in order to overwhelm the address registration
   server.  These attacks may be prevented generic DHCPv6 protection by
   using the AUTH option [RFC3315] or Secure DHCPv6
   [I-D.ietf-dhc-sedhcpv6].

7.  IANA Considerations

   This document defines a new DHCPv6 message, the ADDR-REGISTRATION-
   REQUEST message (TBA1) described in Section 4, that requires an
   allocation out of the registry defined at

   http://www.iana.org/assignments/dhcpv6-parameters/

   This document defines two new DHCPv6 Status code, the
   RegistrationNotSupported (TBA2) and RegistrationDenied (TBA3)
   described in Section 5, that requires an allocation out of the
   registry defined at

   http://www.iana.org/assignments/dhcpv6-parameters/

8.  Acknowledgements

   The authors would like to thank Ralph Droms, Ted Lemon, Bernie Volz,
   Sten Carlsen, Erik Kline, Lorenzo Colitti, Joel Jaeggli, Sten
   Carlsen, Mark Smith, Marcin Siodelski, Darpan Malhotra, Tomek
   Mrugalski and other members of dhc and v6ops working groups for their
   valuable comments.

9.  References

9.1.  Normative References

   [RFC2119]  Bradner, S., "Key words for use in RFCs to Indicate
              Requirement Levels", BCP 14, RFC 2119, March 1997.

   [RFC2136]  Vixie, P., Thomson, S., Rekhter, Y., and J. Bound,
              "Dynamic Updates in the Domain Name System (DNS UPDATE)",
              RFC 2136, April 1997.






Jiang, et al.           Expires January 21, 2015                [Page 7]

Internet-Draft          IPv6 Address Registration              July 2014


   [RFC3315]  Droms, R., Bound, J., Volz, B., Lemon, T., Perkins, C.,
              and M. Carney, "Dynamic Host Configuration Protocol for
              IPv6 (DHCPv6)", RFC 3315, July 2003.

   [RFC3972]  Aura, T., "Cryptographically Generated Addresses (CGA)",
              RFC 3972, March 2005.

   [RFC4703]  Stapp, M. and B. Volz, "Resolution of Fully Qualified
              Domain Name (FQDN) Conflicts among Dynamic Host
              Configuration Protocol (DHCP) Clients", RFC 4703, October
              2006.

   [RFC4704]  Volz, B., "The Dynamic Host Configuration Protocol for
              IPv6 (DHCPv6) Client Fully Qualified Domain Name (FQDN)
              Option", RFC 4704, October 2006.

   [RFC4862]  Thomson, S., Narten, T., and T. Jinmei, "IPv6 Stateless
              Address Autoconfiguration", RFC 4862, September 2007.

   [RFC4941]  Narten, T., Draves, R., and S. Krishnan, "Privacy
              Extensions for Stateless Address Autoconfiguration in
              IPv6", RFC 4941, September 2007.

9.2.  Informative References

   [I-D.ietf-dhc-sedhcpv6]
              Jiang, S., Shen, S., Zhang, D., and T. Jinmei, "Secure
              DHCPv6 with Public Key", draft-ietf-dhc-sedhcpv6-03 (work
              in progress), June 2014.

Authors' Addresses

   Sheng Jiang
   Huawei Technologies Co., Ltd
   Q14, Huawei Campus
   No.156 Beiqing Road
   Hai-Dian District, Beijing 100095
   P.R. China

   Email: jiangsheng@huawei.com











Jiang, et al.           Expires January 21, 2015                [Page 8]

Internet-Draft          IPv6 Address Registration              July 2014


   Gang Chen
   China Mobile
   53A, Xibianmennei Ave., Xuanwu District, Beijing
   P.R. China

   Phone: 86-13910710674
   Email: phdgang@gmail.com


   Suresh Krishnan
   Ericsson
   8400 Decarie Blvd.
   Town of Mount Royal, QC
   Canada

   Phone: +1 514 345 7900 x42871
   Email: suresh.krishnan@ericsson.com


   Rajiv Asati
   Cisco Systems, Inc.
   7025 Kit Creek road
   Research Triangle Park, NC  27709-4987
   USA

   Email: rajiva@cisco.com

























Jiang, et al.           Expires January 21, 2015                [Page 9]
